const typeColors = {
    saiyan: "#ffcc00",  // סאייינים (גו'קו, ווג'יטה, ועוד)
    namekian: "#7ac74c", // נאמקים (פיקולו, דנין)
    frieza: "#6f35fc",   // פריזה
    android: "#a8a77d",   // אנדרואידים (אנדרואיד 17, 18)
    majin: "#c22e28",    // מאג'ין (מאג'ין בואו)
    god: "#f7d02c",      // אלים (אלי היקום, גוד גוקו)
    universal: "#b7b7ce",// לוחמים מכל היקום (הכוחות האדירים)
    fusion: "#f95587",   // פיוז'ן (גוטנקס, וג'יטו)
    human: "#96d9d6",    // בני אדם (קרילין, טין)
    buu: "#e2bf65",      // בואו (מאג'ין בואו)
    super_saiyan: "#fba54c", // סופר סאייין (גו'קו, ווג'יטה במצב סופר)
    kai: "#729f3f",      // קאי (קאיושין, קיביטו)
    tournament: "#735797",  // לוחמים בתחרות (טורניר של היקום)
    space: "#6390f0",     // לוחמים מהחלל (רוסי, רובוטים, ועוד)
};

export default typeColors;
